#+STARTUP: overview indent
#+SETUPFILE: theme-readtheorg.setup
#+TYP_TODO: TRY(y) TEST(t) IMPLEMENT(i) TODO(o) | DONE(d)
#+TODO: | DISABLED(d)

**** Abbreviations

([[http://pages.sachachua.com/.emacs.d/Sacha.html#unnumbered-45][source]])

#+NAME: abbrev
| Base  | Expansion                             |
|-------+---------------------------------------|
| qm    | martinralbrecht@googlemail.com        |
| qb    | https://martinralbrecht.wordpress.com |
| qw    | http://malb.io                        |
| qisg  | Information Security Group            |
| qrhul | Royal Holloway                        |
|-------+---------------------------------------|

#+BEGIN_SRC emacs-lisp :var data=abbrev
(mapc (lambda (x) (define-global-abbrev (car x) (cadr x))) (cddr data))
#+END_SRC

#+RESULTS:
| qb    | [[https://martinralbrecht.wordpress.com]] |
| qw    | [[http://malb.io]]                        |
| qisg  | Information Security Group            |
| qrhul | Royal Holloway                        |

#+BEGIN_SRC emacs-lisp
(setq-default abbrev-mode t)
(diminish 'abbrev-mode)
#+END_SRC

